# Data Cleansing

In [1]:
import pandas as pd
import numpy as np

First, we will open both scrapped addresses, and make 2 Data Frames objects

In [2]:
al1 = pd.read_csv('Scraped Address.csv',index_col=0)
al2 = pd.read_csv('Scraped Address1.csv',index_col=0)

In [3]:
al1.head()

,address,coordinate
0,---,"(-6.143128524262681, 106.91651876468018)"
1,"Alamat,Jl. Mahoni II 1-17, RT.12/RW.5, Sukapur...","(-6.138687045534676, 106.91779793446403)"
2,---,"(-6.138028008918625, 106.9199501681558)"
3,"Alamat,Jl. Panda Lestari II 1-3, RT.8/RW.9, Su...","(-6.143021205256485, 106.9165825639281)"
4,"Alamat,Jakarta Utara, RT.5/RW.5, Sukapura, Kec...","(-6.139193650845594, 106.9214912359129)"

In [4]:
al2.head()

,address,coordinate
0,"Alamat,Jakarta Utara, Sukapura, Kec. Cilincing...","(-6.138905064854615, 106.92099301526054)"
1,"Alamat,Jakarta Utara, RT.8/RW.9, Sukapura, Kec...","(-6.143380928256133, 106.91659303441824)"
2,"Alamat,Jakarta Utara, Sukapura, Kec. Cilincing...","(-6.138587894839157, 106.92060247749289)"
3,"Alamat,Jl. Sukapura 57-29, RT.6/RW.5, Sukapura...","(-6.138783071613571, 106.92303697675014)"
4,"Alamat,RT.1/RW.9, Sukapura, Kec. Cilincing, Ko...","(-6.141040737796685, 106.91792669711212)"

To start our data cleansing, let's take a quick look at their features using df.describe() method

In [5]:
al1.describe()

,address,coordinate
count,5500,5500
unique,3307,5500
top,"Alamat,Jakarta Utara, RW.1, Koja, Kec. Koja, K...","(-6.143128524262681, 106.91651876468018)"
freq,128,1

In [6]:
al2.describe()

,address,coordinate
count,5500,5500
unique,3301,5500
top,"Alamat,Jakarta Utara, RW.1, Koja, Kec. Koja, K...","(-6.138905064854615, 106.92099301526054)"
freq,128,1

Then, we will concatenate both Data Frames, and create a new Data Frames that contains all the attributes from both

In [7]:
fix_add = pd.concat([al1,al2])

In [8]:
fix_add.head()

,address,coordinate
0,---,"(-6.143128524262681, 106.91651876468018)"
1,"Alamat,Jl. Mahoni II 1-17, RT.12/RW.5, Sukapur...","(-6.138687045534676, 106.91779793446403)"
2,---,"(-6.138028008918625, 106.9199501681558)"
3,"Alamat,Jl. Panda Lestari II 1-3, RT.8/RW.9, Su...","(-6.143021205256485, 106.9165825639281)"
4,"Alamat,Jakarta Utara, RT.5/RW.5, Sukapura, Kec...","(-6.139193650845594, 106.9214912359129)"

In [9]:
fix_add.describe()

,address,coordinate
count,11000,11000
unique,5395,11000
top,"Alamat,Jakarta Utara, RW.1, Koja, Kec. Koja, K...","(-6.143128524262681, 106.91651876468018)"
freq,256,1

We can see that from both data we collected, there are about 5000 unique entries. Let's begin to cleanse our data

# Deleting Unnecessary Features

As we can see, all the data contains '---' value which are errors on our scraping process. And all the addresses contains word 'Alamat,' in every start of the address.

In [10]:
fix_add[fix_add['address'] == '---']

     address                                 coordinate
0        ---   (-6.143128524262681, 106.91651876468018)
2        ---    (-6.138028008918625, 106.9199501681558)
5        ---     (-6.14024536916361, 106.9235926617797)
9        ---   (-6.144156589875818, 106.91818344823734)
12       ---    (-6.138818291205267, 106.9171197457654)
13       ---   (-6.138856424436429, 106.92322849340151)
14       ---  (-6.1382475416345175, 106.92174987614321)
15       ---   (-6.141300362822412, 106.91631776326346)
16       ---   (-6.142052106485477, 106.91897999620775)
19       ---   (-6.139036613420874, 106.91978091343606)
20       ---   (-6.140482007774161, 106.91836017560041)
1856     ---   (-6.100681126633242, 106.92044533544411)

In [11]:
fix_add = fix_add[fix_add['address'] != '---']

In [12]:
fix_add['address'] = fix_add['address'].apply(lambda x: x.split('Alamat,')[1])

In [13]:
fix_add.head()

,address,coordinate
1,"Jl. Mahoni II 1-17, RT.12/RW.5, Sukapura, Kec....","(-6.138687045534676, 106.91779793446403)"
3,"Jl. Panda Lestari II 1-3, RT.8/RW.9, Sukapura,...","(-6.143021205256485, 106.9165825639281)"
4,"Jakarta Utara, RT.5/RW.5, Sukapura, Kec. Cilin...","(-6.139193650845594, 106.9214912359129)"
6,"Jl. Anoa Lestari II 3-8, RT.3/RW.9, Sukapura, ...","(-6.141997460800832, 106.91759335813096)"
7,"Jakarta Utara, RT.1/RW.5, Sukapura, Kec. Cilin...","(-6.1375593133889925, 106.9207640635606)"

In [14]:
fix_add.describe()

,address,coordinate
count,10988,10988
unique,5394,10988
top,"Jakarta Utara, RW.1, Koja, Kec. Koja, Kota Jkt...","(-6.138687045534676, 106.91779793446403)"
freq,256,1

In [17]:
fix_add.drop_duplicates(subset='address').describe()

,address,coordinate
count,5394,5394
unique,5394,5394
top,"Jl. Mahoni II 1-17, RT.12/RW.5, Sukapura, Kec....","(-6.138687045534676, 106.91779793446403)"
freq,1,1

In [16]:
fix_add.drop_duplicates(subset='address',keep=False).describe()

,address,coordinate
count,3632,3632
unique,3632,3632
top,"Jakarta Utara, RT.1/RW.5, Sukapura, Kec. Cilin...","(-6.1375593133889925, 106.9207640635606)"
freq,1,1

In [18]:
fix_al = fix_add.drop_duplicates(subset='address')

In [28]:
fix_al.head()

,address,coordinate
1,"Jl. Mahoni II 1-17, RT.12/RW.5, Sukapura, Kec....","(-6.138687045534676, 106.91779793446403)"
3,"Jl. Panda Lestari II 1-3, RT.8/RW.9, Sukapura,...","(-6.143021205256485, 106.9165825639281)"
4,"Jakarta Utara, RT.5/RW.5, Sukapura, Kec. Cilin...","(-6.139193650845594, 106.9214912359129)"
6,"Jl. Anoa Lestari II 3-8, RT.3/RW.9, Sukapura, ...","(-6.141997460800832, 106.91759335813096)"
7,"Jakarta Utara, RT.1/RW.5, Sukapura, Kec. Cilin...","(-6.1375593133889925, 106.9207640635606)"

# Joining the DataFrame into ZP Polygon

In [59]:
no_string(fix_al['coordinate'].iloc[0])

(-6.138687045534676, 106.91779793446403)

In [30]:
import geopandas as gpd
import string

In [58]:
def no_string(text):
    word = [char for char in text if char not in ['(',')',',']]
    word = ''.join(word)
    word = word.split()
    return tuple([float(word[0]), float(word[1])])

In [61]:
fix_al['coordinate'] = fix_al['coordinate'].apply(no_string)

C:\Users\renoi\AppData\Local\Temp/ipykernel_18300/3986222803.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  fix_al['coordinate'] = fix_al['coordinate'].apply(no_string)

In [72]:
fix_al.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5394 entries, 1 to 5499
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   address     5394 non-null   object
 1   coordinate  5394 non-null   object
dtypes: object(2)
memory usage: 255.5+ KB

In [78]:
fix_al['x'] = [x[0] for x in fix_al['coordinate']]
fix_al['y'] = [x[1] for x in fix_al['coordinate']]

C:\Users\renoi\AppData\Local\Temp/ipykernel_18300/2012975723.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  fix_al['x'] = [x[0] for x in fix_al['coordinate']]
C:\Users\renoi\AppData\Local\Temp/ipykernel_18300/2012975723.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  fix_al['y'] = [x[1] for x in fix_al['coordinate']]

In [115]:
gdf_al = gpd.GeoDataFrame(fix_al,geometry=gpd.points_from_xy(fix_al.y,fix_al.x))

In [86]:
gdf_al.to_file('Sample Address.geojson',driver='GeoJSON')

In [116]:
koja = gpd.GeoDataFrame.from_file("Zona Pengawasan Koja.geojson")

In [119]:
gdf_fix = gdf_al.sjoin(koja)

In [117]:
gdf_al = gdf_al.set_crs(epsg=4326)

In [132]:
gdf_fix = gdf_fix[['address','geometry','Zona']]

In [133]:
gdf_fix.to_file('Sample Address Fix.geojson',driver='GeoJSON')